---
layout: package
title: FGLM
---

# fglm -- convert a Groebner basis

## Synopsis

- Usage: 
: `H = fglm(G, R)`
: `H = fglm(I, R)`
- Inputs:
   - `G`, a <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/Macaulay2Doc/html/___Groebner__Basis.html">Groebner basis</a>
, the starting Groebner basis
   - `I`, an <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/Macaulay2Doc/html/___Ideal.html">ideal</a>
, the starting ideal
   - `R`, a <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/Macaulay2Doc/html/___Ring.html">ring</a>
, a ring with the target monomial order
- Outputs:
   - `H`, a <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/Macaulay2Doc/html/___Groebner__Basis.html">Groebner basis</a>
, the new Groebner basis in the target monomial order

## Description
FGLM takes a Groebner basis of an ideal with respect to one monomial order and changes it into a Groebner basis of the same ideal over a different monomial order. The initial order is given by the ring of G and the target order is the order in R. When given an ideal I as input a Groebner basis of I in the ring of I is initially computed directly, and then this Groebner basis is converted into a Groebner basis in the ring R.

```macaulay2
i1 : R1 = QQ[x,y,z];

i2 : I1 = ideal(x^2 + 2*y^2 - y - 2*z, x^2 - 8*y^2 + 10*z - 1, x^2 - 7*y*z);

o2 : Ideal of R1

i3 : R2 = QQ[x,y,z, MonomialOrder => Lex];

i4 : fglm(I1, R2)

o4 = GroebnerBasis[status: done; S-pairs encountered up to degree 0]

o4 : GroebnerBasis
```
{:.examples}

## Caveat
The ideal I generated by G must be zero-dimensional. The target ring R must be the same ring as the ring of G or I, except with different monomial order. R must be a polynomial ring over a field.

## See also

- <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/FGLM/html/index.html" title="Compute Groebner bases via the FGLM algorithm">FGLM</a> -- Compute Groebner bases via the FGLM algorithm
- <a href="/home/mahrud/Projects/M2/M2/M2/BUILD/build/usr-dist/common/share/doc/Macaulay2/Macaulay2Doc/html/_groebner__Basis.html" title="Gröbner basis, as a matrix">groebnerBasis</a> -- Gröbner basis, as a matrix

## Ways to use `fglm` :

- fglm(GroebnerBasis,Ring)
- fglm(Ideal,Ring)
{:.waystouse}
